hangout-manager/web/app/models/user.rb

SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 6 AND `likes`.`hang_out_id` = 15 LIMIT 1
---
  def already_liked?(hang_out)
    self.likes.exists?(hang_out_id: hang_out.id)