hangout-manager/web/app/views/hang_outs/_table.html.erb

            <% hang_out.save %>
          <% elsif (hang_out.likes.count >= hang_out.upper_member) then %>
            <% hang_out.label = 1 %>
            <% hang_out.save %>
          <% elsif (hang_out.likes.count < hang_out.upper_member) then %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`hang_out_id` = 15
UPDATE `hang_outs` SET `hang_outs`.`label` = 1, `hang_outs`.`updated_at` = '2020-08-14 13:18:15.006894' WHERE `hang_outs`.`id` = 15
SELECT COUNT(*) FROM `likes` WHERE `likes`.`hang_out_id` = 11

        <td><%= hang_out.start_time.strftime("%-H時%-M分") %> ~ <%= hang_out.end_time.strftime("%-H時%-M分") %></td>
        <td><%= hang_out.likes.count %></td>
        <td><%= hang_out.upper_member %></td>
        <td><%= hang_out.comments.count %></td>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`hang_out_id` = 15
SELECT COUNT(*) FROM `comments` WHERE `comments`.`hang_out_id` = 15