hangout-manager/web/app/controllers/questions_controller.rb

  def get_json
    @question = Question.find(params[:id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 3 LIMIT 1

  def create
    @question = Question.new(question_params)
    @question.user_id = current_user.id
    @question.save
---
INSERT INTO `questions` (`q_one`, `q_two`, `q_three`, `created_at`, `updated_at`) VALUES (3, 6, 1, '2020-08-14 13:05:33.240846', '2020-08-14 13:05:33.240846')

    def set_question
      @question = Question.find(params[:id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 3 LIMIT 1