hangout-manager/web/app/views/mypage/show.html.erb

SELECT `hang_outs`.* FROM `hang_outs` WHERE `hang_outs`.`user_id` = 6
---
            <tbody>
              <% current_user.hang_outs.each do |hang_out| %>

SELECT `likes`.* FROM `likes` WHERE `likes`.`user_id` = 6
---
            <tbody>
              <% current_user.likes.each do |like| %>